blog/2021/sky-cloud.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 09:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Draw Sky, Cloud</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Draw Sky, Cloud</h1>
</header><p>
<a href="https://css-tricks.com/drawing-realistic-clouds-with-svg-and-css/">https://css-tricks.com/drawing-realistic-clouds-with-svg-and-css/</a>
</p>

<p>
主要使用了 SVG。它是基于 XML 的标记语言，用来描绘二维向量图形。下面会列出本次练习使用的元素或属性，并解释作用。
</p>

<ul class="org-ul">
<li>svg 一个容器，用于定义新的坐标系和视图</li>
<li>filter 通过对原始图形进行原子级别的分组，来自定义过滤效果</li>
<li>feTurbulence 使用 Perlin 湍流函数生成图像，可以合成云或大理石</li>
<li>type 通用属性，基于不同元素表达不同含义
<ul class="org-ul">
<li>对于 feTurbulence 来说，它指示滤波器应该执行噪声还是湍流函数，type 的值：fractalNoise | turbulence</li>
</ul></li>
<li>baseFrequency 表示 feTurbulence 噪声函数的基准频率</li>
<li>numOctaves 定义了噪声函数的八度数</li>
<li>seed 表示伪随机数生成器的起始数</li>
<li>feDisplacementMap The &lt;feDisplacementMap&gt; SVG filter primitive uses the pixel values from the image from in2 to spatially displace the image from in（完全不理解这句的含义）</li>
<li>in 标识输入</li>
<li>scale 定义了位移缩放因子</li>
</ul>
</div>
</body>
</html>